{"keras_version": "2.1.4", "config": [{"config": {"activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 512, "kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "batch_input_shape": [null, 47494]}, "class_name": "Dense"}, {"config": {"seed": null, "name": "dropout_1", "rate": 0.2, "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 512, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_2", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"seed": null, "name": "dropout_2", "rate": 0.2, "trainable": true, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 4, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_3", "bias_regularizer": null, "bias_constraint": null, "activation": "softmax", "kernel_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}